Repository: mrssd/wc-telegram-notifications
Catalog: languages/wc-telegram-notifications-*.po
Languages: fa_ir

source: Order and Stock Notifications via Telegram Bot for WooCommerce
fa_ir: اطلاع رسانی اعلان های ووکامرس با ربات تلگرام

source: Send WooCommerce order status updates directly to Telegram using Bot API or Google Apps Script
fa_ir: ارسال اعلان سفارشات ووکامرس به ربات تلگرام با وبسرویس رسمی تلگرام و یا Google Apps Script برای کشوری دارای محدودیت

source: Satyar Salehian
fa_ir: ساتیار صالحیان

source: Telegram Notifications
fa_ir: اطلاع رسانی ربات تلگرام

source: Telegram Notifications Settings
fa_ir: تنظیمات

source: Configure your Telegram bot settings for WooCommerce order notifications. <a href="%s" target="_blank">Watch our tutorial video</a> to learn how to setup this plugin.
fa_ir: ربات تلگرام خود را برای اعلان های ووکامرس تنظیم کنید. <a href="%s" target="_blank">مشاهده ویدیو آموزشی</a> متوانید با این ویدیو نحوه تنظیمات ربات و همچنین توضیحات مربوط به افزونه را مشاهده کنید.

source: Telegram Bot Token
fa_ir: توکن ربات

source: Enter your Telegram Bot Token
fa_ir: توکن ربات تلگرام را وارد کنید

source: Chat ID / Group ID
fa_ir: شناسه چت / شناسه گروه یا سوپر گروه

source: Enter your Telegram Chat ID or Group ID
fa_ir: شناسه چت یا گروه را وارد کنید

source: - To find your Chat ID, use @userinfobot
fa_ir: - برای دریافت شناسه کاربری خود از ربات @userinfobot استفاده کنید

source: - To find your Group ID, add this @getidsbot bot to your group. After getting group ID remmeber to remove this bot from the group.
fa_ir: - برای دریافت شناسه گروه ابتدا ربات @getidsbot در گروه عضو کرده و پس از دریافت شناسه آن را حذف کنید.

source: - If you are using a Super Group, prepend the group ID with -100. For example, if your group ID is 123456789, use -100123456789.
fa_ir: - اگر از سوپر گروه یا گروه های تایپک دار استفاده می کنید، ایدی گروه باید با عبارت “-100” شروع شود. به طور مثال ایدی 123456789 باید در تنظیمات به صورت “-100123456789” تنظیم گردد.

source: - If you are using a normal group, prepend the group ID with -100. For example, if your group ID is 123456789, use -100123456789.
fa_ir: - اگر از گروه معمولی استفاده می کنید، ایدی گروه باید با عبارت “-100” شروع شود. به طور مثال ایدی 123456789 باید در تنظیمات به صورت “-100123456789” تنظیم گردد.

source: Orders Topic ID
fa_ir: شناسه تایپک برای سفارشات

source: Enter your Telegram topic ID for Super Groups or leave it empty if you use normal group or chat.
fa_ir: ایدی تایپک سفارشات را برای سوپر گروه تنظیم کنید و یا برای ارسال عادی خالی بگذارید. ویدیو آموزشی را درباره این مورد مشاهده کنید.

source: Order Status Triggers
fa_ir: وضعیت های سفارشات

source: Select which order statuses should trigger notifications
fa_ir: وضعیت هایی که قصد دریافت اعلان برای آنها دارید را انتخاب کنید

source: Message Template
fa_ir: متن پیام

source: Customize your notification message. Available tags: {order_id}, {status}, {customer_name}, {currency}, {total}, {total_formated}, {billing_email}, {shipping_method}, {payment_method}, {date}, {time}, {products}
fa_ir: می توانید از متغییر های زیر استفاده کنید : ‬ ‏‫{order_id}, {status}, {customer_name}, {currency}, {total}, {total_formated}, {billing_email}, {shipping_method}, {payment_method}, {date}, {time}, {products}

source: Use Google Apps Script
fa_ir: استفاده از Google Apps Script

source: Enable to use Google Apps Script instead of direct Telegram API
fa_ir: فعال سازی ارسال از طریق Google Apps Script برای کشور های دارای محدودیت

source: Google Script Web App URL
fa_ir: آدرس لینک Google Apps Script

source: Enter your Google Apps Script Web App URL
fa_ir: لینک عمومی Google Apps Script خود را وارد کنید

source: Enable Stock Notifications
fa_ir: فعال سازی اعلان کمبود کالا

source: Send notifications when products become out of stock
fa_ir: با فعال سازی این گزینه در صورت اتمام یا کمبود کالا اعلان ارسال می شود

source: Topic ID for Stock
fa_ir: تایپک سوپر گروه برای اعلان کمبود یا اتمام کالا

source: Enter your Telegram topic ID for Stock - if this does not set the defult ones will use or leave it empty
fa_ir: ایدی تاپیک سوپر گروه برای اعلان های کمبود موجودی کالا - صورتی که خالی گذاشته شود از تنظیمات اعلان سفارشات استفاده می شود

source: Test Notifications
fa_ir: ارسال پیام تستی

source: Send a test message to verify your settings.
fa_ir: می توانید برای بررسی صحت تنظیمات پیام تستی ارسال کنید - قبل از ارسال یک بار تنظیمات را ذخیره کنید.

source: Send Test Message
fa_ir: ارسال پیام تستی

source: Test message sent successfully!
fa_ir: پیام تستی با موفقیت ارسال شد!

source: Failed to send test message. Please check your settings.
fa_ir: ارسال پیام با خطا مواجه شد - تنظیمات را بررسی کنید.

source: Quantity
fa_ir: تعداد

source: is out of stock
fa_ir: ناموجود شد

source: is getting out of stock
fa_ir: در حال اتمام است

source: ⚠️ Product %s
fa_ir: ⚠️ محصول %s

source: Name: %1$s
fa_ir: نام محصول: %1$s

source: ID: #%2$s
fa_ir: شناسه: #%2$s

source: Price: %3$s
fa_ir: قیمت: %3$s

source: Quantity: %4$s
fa_ir: موجودی : %4$s

source: Product link :
fa_ir: لینک محصول :

source: You do not have sufficient permissions to access this page.
fa_ir: شما دسترسی لازم به این صفحه را ندارید.

source: \nThis is a test message from your WooCommerce Telegram Notifications plugin.
fa_ir: این یک پیام تستی برای افزونه اعلان سفارشات ووکامرس در تلگرام است.
